#include "tmatrix.h"
#include "tnmint.h"
#include "tnmvec.h"
#include "tnmmtr.h"
#include "tcmplx.h"
#include "tnmcvec.h"





	//--------------------------------------------------------------------
    //! \defgroup nmtl контроль переполнения
    //! \ingroup implement
    //! \ru определяет классы, предназначенные для контроля переполнения
    //!     при реализации библиотеки на PC.
    //! 
    //! \ru –реализации библиотеки на PC производит контроль переполнения 
    //!     с выдачей сообщения об ошибке пользователю библиотеки. Для этой цели определены
    //!     шаблонные классы для вектора, матрицы и скалярного числа, позволяющие
    //!     производить базовые операции над их элементами.

	//--------------------------------------------------------------------