#include "tmatrix.h"
#include "tnmint.h"
#include "tnmvec.h"
#include "tnmmtr.h"
#include "tcmplx.h"
#include "tnmcvec.h"





	//--------------------------------------------------------------------
    //! \defgroup nmtl контроль переполнени¤
    //! \ingroup implement
    //! \ru определяет классы, предназначенные для контроля переполнени¤
    //!     при реализации библиотеки на PC.
    //! 
    //! \ru –реализации библиотеки на PC производит контроль переполнени¤ 
    //!     с выдачей сообщени¤ об ошибке пользователю библиотеки. Для этой цели определены
    //!     шаблонные классы дл¤ вектора, матрицы и скалярного числа, позвол¤ющие
    //!     производить базовые операции над их элементами.

	//--------------------------------------------------------------------