//***************************************************************************/
//*                                                                         */
//*                    Neuroprocessor NM6403 SDK v.1.2                      */
//*                                                                         */
//*				Signed Fixed Point 32-bit Routine                           */
//*                                                                         */
//*             Вычисление синуса числа с фиксированной запятой             */
//*                                                                         */
//*                                                                         */
//*                1999 (c) RC Module Inc., Moscow, Russia                  */
//***************************************************************************/
//	Arg1 - Angle
//--------------------------
//	Res1 - Sin
//!!!!!!!!!!!!!!!!!!! МЕНЯТЬ ЗДЕСЬ !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
const FIXPOINT=16; //Положение двоичной точки в 32-х разрядном слове
const N=9;//804-точки - константа определяющая размер массива значениц синуса 
//const N=10//1608-точек
//!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
const PI2 = (6487ed51h >> (30-FIXPOINT)) ;//PI2=90 град.
const MAXINDEX=PI2 >> (FIXPOINT-N);//Размер массива значений синуса

import from macros.mlb;
extern FixSinDat:word;
begin ".text_nmplс"
//////////////////////////////////////////////////////////////////////////////
//                                                                          //
//                            Fixed  Point Sine                             //
//                                                                          //
//////////////////////////////////////////////////////////////////////////////
//! \fn int SCL_TblFixSin32(int nArg)
//! 
//! \perfinclude _SCL_TblFixSin32__Fi.html
global _SCL_TblFixSin32:label;
<_SCL_TblFixSin32>
.branch;
	ar5 = sp-2;
	gr7 = [--ar5];
	push ar1,gr1 with gr7;
	//with gr7=Arg;// аргумент передается через gr7			 
	//Вычисление модуля угла
	if >= delayed skip 4 with gr1=gr7;
		ar1=FixSinDat ;
	gr1=-gr1;
	nul;
	//Определение четверти ,соответсвующей данному углу
		gr1 >>=(FIXPOINT-N);	//Вычисление индекса по значению угла
		gr7=[ar1+=gr1] with gr7;
	//Коррекция знака арксинуса	 
	if >= delayed skip 4;
		pop ar1,gr1;
		nul;
	gr7=-gr7;
	nul;
	return;


.wait;
end ".text_nmplс";
